Revit 2024 API
RevitLinkOptions Constructor
Overload List
Name | Description
RevitLinkOptions(Boolean)
 Creates a RevitLinkOptions object, specifying relative or absolute path type. If the link is workshared, all worksets will be opened.
RevitLinkOptions(RevitLinkOptions)
 Constructs a new copy of the input RevitLinkOptions object.
RevitLinkOptions(Boolean, WorksetConfiguration)
 Creates a RevitLinkOptions object, specifying relative or absolute path type, and the desired workset configuration.
See Also
RevitLinkOptions Class
RevitLinkOptions Members
Autodesk.Revit.DB Namespace